<?php

function landing($phrase)
{
  static $lang = array(
    'HOME' => 'الصفحة الرئيسية',
    'HOME DESC' => 'افضل سيستم متكامل لإدارة الشبكات',
    'FEATURES' => 'مميزات السيستم',
    'DRAW NETWORK AND CAMERAS' => 'رسم أجهزة الشبكة وكاميرات المراقبة',
    'CONNECT TO GOOGLE MAPS' => 'ربط السيستم بخرائط جوجل',
    'DRAW INTEGRATED PROJECT PLAN' => 'رسم مخطط مشروع متكامل',
    'IDENTIFY ALT SOURCE' => 'تحديد المصدر البديل',
    'DEVICES STATUS' => 'حالة الأجهزة',
    'ALERTS AND WARNINGS' => 'التنبيهات والتحذيرات',
    'REMOTE ACCESS' => 'الوصول عن بُعد',
    'BACKUP' => 'النسخة الإحتياطية',
    'DEVICES REPORTS' => 'تقارير الأجهزة',
    'CLIENTS REPORTS' => 'تقارير العملاء',
    'COMPLAINTS AND MAINTENANCE MANAGEMENT' => 'إدارة الشكاوى والصيانة',
    'SEND TECHNICIANS EFFICIENTLY' => 'إرسال الفنيين بكفاءة',
    'BUSINESS DOCUMENTATION' => 'توثيق الأعمال',
    'DATES MATTERS' => 'مواعيد الأمور',
    'CUSTOMERS RATES' => 'تقييم العملاء',
    'CONTROLLING EMP PERMISSIONS' => 'التحكم بصلاحيات الموظفين',
    'DATA ENTRY' => 'إدخال البيانات',
    
    'USERS AND COMPANIES USES SYSTEM' => 'عميل وشركة يستخدمون',
    'AGENTS RECOMMEND SYSTEM' => 'وكيل معتمد يوصي بإستخدام',
    'TREENET PRODUCTION READY' => 'سيستم إداري متكامل سهل وسريع الإستخدام',
    'BECOME AGENT' => 'يمكنك أن تصبح وكيلنا المعتد بكل سهولة',
    'KNOW AGENTS' => 'تعرف علي وكلائنا المعتمدون',
    'KNOW FEATURES' => 'تعرف علي مميزات النظام',
    'DRAW NETWORK AND CAMERAS DESC' => 'يسمح النظام برسم هيكلية الشبكة وتوضيح تسلسل وتواصل البيانات بين الأجهزة والكاميرات على شكل شجرة، مما يسهل فهم وتصور الشبكة بشكل بصري',
    'CONNECT TO GOOGLE MAPS DESC' => 'يقم Tree Net ربطاً فعالاً مع خرائط Google لتوفير رؤية واضحة وشاملة للشبكة. يمكنك تحديد أماكن الأجهزة بسهولة ومشاهدتها علي الخريطة. سترى هيكلة الشبكة وتسلسل وتواصل البيانات بين أجهزة الإرسال والإستقبال بشكل بصري ومباشر.',
    'DRAW INTEGRATED PROJECT PLAN DESC' => 'يمكنك استخدام Tree Net لرسم الشبكة بشكل مفصل وسهل القراءة. ستتمكن من تغطية المكان المستهدف بسهولة وفهم توزيع الأجهزة والعملاء والإتجاهات علي الخريطة.',
    'IDENTIFY ALT SOURCE DESC' => 'يوفر النظام إمكانية تحديد مصدر بديل لكل جزء في الشبكة، مما يسهل سرعة التعامل مع المشكلات ونقل العملاء إلى الجهاز المحدد لحل المشكلة في اسرع وقت',
    'DEVICES STATUS DESC' => 'يتم تمييز حالة األجهزة في النظام بألوان مختلفة. حيث يتم عرض الأجهزة التي تعمل باللون الأخضر والأجهزة المفصولة باللون الأحمر، مما يتيح لك الرؤية السريعة لحالة الأجهزة',
    'ALERTS AND WARNINGS DESC' => 'يقوم النظام بإرسال تنبيهات وإشعارات في حالة فصل أي جهاز أو كاميرا مما يسمح للمسؤول باتخاذ الإجراءات اللازمة لحل المشكلة',
    'REMOTE ACCESS DESC' => 'يتيح النظام فتح الأجهزة من أي مكان في العالم، وأيضاً إجراء اختبار Ping على أي جهاز لتحديد متوسط وقت االستجابة وفقدان البيانات المرفقة بكل جهاز مما يتيح التحكم وإدارة الشبكات عن ُبعد بسهولة',
    'BACKUP DESC' => 'يمكن أيضاً إرفاق نسخة احتياطيه Backup لكل جهاز، حيث يتم تضمين جميع الإعدادات في حالة حدوث أي مشكلة، مما يوفر وقت وجهًدا في تكوين الأجهزة من جديد كما يمكن إرفاق جميع بيانات الأجهزة مثل عنوان IP و SSID و MAC و Channel وغيرها وذلك لتكون مرجعا للموظفين',
    'DEVICES REPORTS DESC' => 'يوفر النظام تقارير شاملة عن جميع الأجهزة المستخدمة في الشبكة وبياناتهم الكاملة وموقعهم (Location) مما يسهل تحديد مكان الجهاز بدقه ، بما في ذلك عدد ونوع الأجهزة ونوع الإتصال سواء كان لاسلكياً أو عبر الألياف البصرية أو الكابالت النحاسية',
    'CLIENTS REPORTS DESC' => 'يوفر النظام تقارير شاملة عن العملاء ويتيح لك تحديد عدد الشكاوى التي تم تقديمها على مدار الشهر أو السنة، مما يساعدك في تحليل أداء الخدمة وتلبية احتياجات العملاء',
    'COMPLAINTS AND MAINTENANCE MANAGEMENT DESC' => 'يوفر النظام واجهة لموظف خدمة العملاء لتقديم طلبات للفنيين، سواء لحل مشكلة أو تركيب جهاز جديد , كما يوفر النظام واجهة للفنيين لمتابعة الأوردرات المنتهية والمؤجلة والتي لم تنتهى بعد، مما يسهل عملهم وتنظيمه',
    'SEND TECHNICIANS EFFICIENTLY DESC' => 'يمكنك إرسال الفنيين لحل مشاكل الأجهزة بسهولة عن طريق الإحداثيات. ستتمكن من توجه الفنيين غلي الأجهزة المحددة بدقة علي الخريطة مما يوفر الوقت والجهد في حل المشاكل.',
    'BUSINESS DOCUMENTATION DESC' => 'بعد انتهاء الفني من حل المشكلة، يمكنه إرفاق صور للأجهزة بعد الصيانة وتكلفة الإصلاح وصورة من ايصال التكلفة, ويمكنه أيضاً تعليق ملاحظات حول المشكلة مما يسهل ذلك على المدير إدارة ومتابعة أعمال الفنيين',
    'DATES MATTERS DESC' => 'يقوم النظام بتحديد موعد الشكوي وموعد رؤيتها وموعد حلها , ويحسب المدة الزمنية المستغرقة لإنهاء الأمر منذ فتح الشكوى وحتى غلقها، مما يسهل على المدير متابعة الفنيين. كما يمكن تحديد آخر موعد تم فيه تحديث بيانات الأمر ومن قام بالتحديث، مما يسهل على الموظفين استكمال عمل زمالئهم . ايضاً يمكن تحديد وتسجيل مواعيد الزيارة للعملاء والمناطق الرئيسيه ، سواء كانت في أي وقت أو بعد الإتصال المسبق',
    'CUSTOMERS RATES DESC' => 'بعد حل المشكلة، يوفر النظام إمكانية تقييم وتسجيل رضا العميل عن الخدمة والموظف، ومراجعة الحساب المالي المستلم',
    'CONTROLLING EMP PERMISSIONS DESC' => 'يوفر النظام إمكانية تعيين صلاحيات مختلفة للموظفين، بما في ذلك التعديل والحذف والإضافة وغيرها، مما يسمح بتنظيم عملية الإدارة',
    'DATA ENTRY DESC' => 'يمكن إرفاق جميع بيانات الأجهزة والعملاء عن طريق ملف Excel مما يسهل على المستخدم العمل على النظام ويوفر عناء إدخال البيانات',

    
  );

  // return the phrase
  return array_key_exists($phrase, $lang) ? $lang[$phrase] : null;
}
