<?php

/**
 * function of words in arabic
 */
function description($phrase)
{
  static $lang = array(
  // words
  'TREENET' => 'TREE NET',
  'ABSTRACT' => 'نبذ مختصرة',
  'SERVICE NAME' => 'إسم الخدمة',
  'SERVICE ADVANTAGE' => 'مميزات الخدمة',
  'DRAW NETWORK AND CAMERAS' => 'رسم أجهزة الشبكة وكاميرات المراقبة',
  'IDENTIFY ALT SOURCE' => 'تحديد المصدر البديل',
  'DEVICES STATUS' => 'حالة الأجهزة',
  'ALERTS AND WARNINGS' => 'التنبيهات والتحذيرات',
  'REMOTE ACCESS' => 'الوصول عن بُعد',
  'BACKUP' => 'النسخة الإحتياطية',
  'DEVICES REPORTS' => 'تقارير الأجهزة',
  'CLIENTS REPORTS' => 'تقارير العملاء',
  'COMPLAINTS AND MAINTENANCE MANAGEMENT' => 'إدارة الشكاوى والصيانة',
  'BUSINESS DOCUMENTATION' => 'توثيق الأعمال',
  'DATES MATTERS' => 'مواعيد الأمور',
  'CUSTOMERS RATES' => 'تقييم العملاء',
  'CONTROLLING EMP PERMISSIONS' => 'التحكم بصلاحيات الموظفين',
  'DATA ENTRY' => 'إدخال البيانات',
  'CURRENT VERSION' => 'الإصدار الحالى',
  'DEVELOPMENT PROCESS' => 'تطوير النظام',


  // large statements
  'TREENET SPONSOR' => 'هو سيستم مقدم من شركة',
  'TREENET DESC' => 'هي خدمة تقدمها شركتنا لتسهيل تنظيم وإدارة أجهزة الشبكة والعملاء لديك',
  'TREENET NAME DESC' => 'تُسمى هذة الخدمة بإسم TREE NET',
  'TREENET ADV DESC' => 'سيستم TREE NET هو نظام إدارة الشبكات والأنظمة الأمنية الذي يوفر العديد من المميزات لتسهيل عملية إدارة الشبكات والتحكم فيها',
  'TREENET ADV DESC 2' => 'هذه هي بعض المميزات الرئيسية لنظام TREE NET لإدارة الشبكات والنظم الأهلية. يمكن أن يحتوي على النظام على المزيد من المميزات التي يتعذر شرحها بالتفصيل هنا. يهدف هذا النظام إلى تسهيل إدارة الشبكات',
  'DRAW NETWORK AND CAMERAS DESC' => 'يسمح النظام برسم هيكلية الشبكة وتوضيح تسلسل وتواصل البيانات بين الأجهزة والكاميرات على شكل شجرة، مما يسهل فهم وتصور الشبكة بشكل بصري',
  'IDENTIFY ALT SOURCE DESC' => 'يوفر النظام إمكانية تحديد مصدر بديل لكل جزء في الشبكة، مما يسهل سرعة التعامل مع المشكلات ونقل العملاء إلى الجهاز المحدد لحل المشكلة في اسرع وقت',
  'DEVICES STATUS DESC' => 'يتم تمييز حالة األجهزة في النظام بألوان مختلفة. حيث يتم عرض الأجهزة التي تعمل باللون الأخضر والأجهزة المفصولة باللون الأحمر، مما يتيح لك الرؤية السريعة لحالة الأجهزة',
  'ALERTS AND WARNINGS DESC' => 'يقوم النظام بإرسال تنبيهات وإشعارات في حالة فصل أي جهاز أو كاميرا مما يسمح للمسؤول باتخاذ الإجراءات اللازمة لحل المشكلة',
  'REMOTE ACCESS DESC' => 'يتيح النظام فتح الأجهزة من أي مكان في العالم، وأيضاً إجراء اختبار Ping على أي جهاز لتحديد متوسط وقت االستجابة وفقدان البيانات المرفقة بكل جهاز مما يتيح التحكم وإدارة الشبكات عن ُبعد بسهولة',
  'BACKUP DESC' => 'يمكن أيضاً إرفاق نسخة احتياطيه Backup لكل جهاز، حيث يتم تضمين جميع الإعدادات في حالة حدوث أي مشكلة، مما يوفر وقت وجهًدا في تكوين الأجهزة من جديد كما يمكن إرفاق جميع بيانات الأجهزة مثل عنوان IP و SSID و MAC و Channel وغيرها وذلك لتكون مرجعا للموظفين',
  'DEVICES REPORTS DESC' => 'يوفر النظام تقارير شاملة عن جميع الأجهزة المستخدمة في الشبكة وبياناتهم الكاملة وموقعهم (Location) مما يسهل تحديد مكان الجهاز بدقه ، بما في ذلك عدد ونوع الأجهزة ونوع الإتصال سواء كان لاسلكياً أو عبر الألياف البصرية أو الكابالت النحاسية',
  'CLIENTS REPORTS DESC' => 'يوفر النظام تقارير شاملة عن العملاء ويتيح لك تحديد عدد الشكاوى التي تم تقديمها على مدار الشهر أو السنة، مما يساعدك في تحليل أداء الخدمة وتلبية احتياجات العملاء',
  'COMPLAINTS AND MAINTENANCE MANAGEMENT DESC' => 'يوفر النظام واجهة لموظف خدمة العملاء لتقديم طلبات للفنيين، سواء لحل مشكلة أو تركيب جهاز جديد , كما يوفر النظام واجهة للفنيين لمتابعة الأوردرات المنتهية والمؤجلة والتي لم تنتهى بعد، مما يسهل عملهم وتنظيمه',
  'BUSINESS DOCUMENTATION DESC' => 'بعد انتهاء الفني من حل المشكلة، يمكنه إرفاق صور للأجهزة بعد الصيانة وتكلفة الإصلاح وصورة من ايصال التكلفة, ويمكنه أيضاً تعليق ملاحظات حول المشكلة مما يسهل ذلك على المدير إدارة ومتابعة أعمال الفنيين',
  'DATES MATTERS DESC' => 'يقوم النظام بتحديد موعد الشكوي وموعد رؤيتها وموعد حلها , ويحسب المدة الزمنية المستغرقة لإنهاء الأمر منذ فتح الشكوى وحتى غلقها، مما يسهل على المدير متابعة الفنيين. كما يمكن تحديد آخر موعد تم فيه تحديث بيانات الأمر ومن قام بالتحديث، مما يسهل على الموظفين استكمال عمل زمالئهم . ايضاً يمكن تحديد وتسجيل مواعيد الزيارة للعملاء والمناطق الرئيسيه ، سواء كانت في أي وقت أو بعد الإتصال المسبق',
  'CUSTOMERS RATES DESC' => 'بعد حل المشكلة، يوفر النظام إمكانية تقييم وتسجيل رضا العميل عن الخدمة والموظف، ومراجعة الحساب المالي المستلم',
  'CONTROLLING EMP PERMISSIONS DESC' => 'يوفر النظام إمكانية تعيين صلاحيات مختلفة للموظفين، بما في ذلك التعديل والحذف والإضافة وغيرها، مما يسمح بتنظيم عملية الإدارة',
  'DATA ENTRY DESC' => 'يمكن إرفاق جميع بيانات الأجهزة والعملاء عن طريق ملف Excel مما يسهل على المستخدم العمل على النظام ويوفر عناء إدخال البيانات',
  'DEVELOPMENT PROCESS DESC' => 'يتم تطوير TREE NET بصفة دائمة ومستمرة ليُلبى إحتياجات المستخدمين له',
  'TAKE TRIAL VERSION' => 'كيفية الإستفادة من النسحة المجانية',
  'VISIT SYSTEM LOGIN' => 'يُمكنك تسجيل الدخول الي TREE NET إذا كنت تمتلك حساب بالفعل',
  'VISIT SYSTEM SIGNUP' => 'يُمكنك تسجيل حساب جديد إذا كنت لا تمتلك حساب',
  'ADD COMPANY NAME' => 'إدخال إسم شركتك مع الأخذ في الإعتبار',
  'DON`T WRITE ANY SPECIAL CHARACHTERS' => 'لا تقُم بكتابة أى حروف خاصة',
  'DON`T WRITE ANY NUMBERS' => 'لا تقُم بكتابة أى أرقام',
  'DON`T WRITE ANY WHITE SPACES' => 'لا تقُم بكتابة أى مسافات',
  'SAVE COMPANY CODE' => 'إحتفظ بكود شركتك المكون من حرفين ورقمين لإستخدامة في عملية تسجيل الدخول ولا تقُم بمشاركته مع أحد',
  'ENTER THE MANAGER NAME' => 'قُم بإدخال إسم مدير الشركة',
  'ENTER MANAGER PHONE' => 'قُم بإدخال رقم تليفون المدير صحيحاً ويُفضل أن يكون لديه حساب واتس اب',
  'ENTER ADMIN FULL NAME' => 'قُم بإدخال إسم الأدمن كاملاً',
  'CHOOSE ADMIN GENDER' => 'قم بإدخال جنس الأدمن',
  'ENTER ADMIN USERNAME TO LOGIN' => 'قم بإدخال إسم المسخدم للأدمن مع مراعاة أنه سوف يُستخدم لعملية تسجيل الدخول',
  'ENTER ADMIN PASSWORD TAKING INTO ACCOUNT DON`T SHARE IT' => 'قُم بتعيين كلمة المرور الخاصة بالأدمن ولا تقُم بمشاركتها مع أحد',

  );
  // return the phrase
  return array_key_exists($phrase, $lang) ? $lang[$phrase] : null;
}